---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexPoint.GetSizeInShortInts
source: html/c4c7b40e-5d86-1904-12b6-b52de7ba4bf9.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPoint.GetSizeInShortInts Method

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.

## Syntax (C#)
```csharp
public static int GetSizeInShortInts()
```

## Returns
The number of short integers occupied by the primitive.